// detect rclone use
DeviceProcessEvents
 | where FileName has_any ("rclone")  or ProcessVersionInfoOriginalFileName has_any ("rclone") or InititaingProcessVersionInfoOriginalFileName has_any ("rclone") 
